Energy/worldbuilding.org
#+TITLE: Energy World Building
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="https://gongzhitaao.org/orgcss/org.css"/>


* Energy
** Basic Energy Rules
All energy requires the user to channel it to be, used. Most energies require both arms to be free for the elbow down.
*** Energy points (ep)
Some energies require (ep) to use (there are: Life, Kinetic, Time). Energy points is; stored, named, measured and, regained differently for each energy. The energies that don't use (ep) simply manipulate the already excising energy in the world.   
*** Energy Devices and Crystals
Energy is a form of power and it obeys the [[https://en.wikipedia.org/wiki/First_law_of_thermodynamics][first law of thermodynamics]] energy crystals are natural deposits of energy most of witch act as batteries as such they can be discharged and then recharged (only can be recharged by a user of the same energy as the crystal). These crystals can be used to power different devices that then can do thighs similar to use energy but at a much lower efficacy.    

** Energy Types
| Color  | Name      | Description                                                                                                           |
|--------+-----------+-----------------------------------------------------------------------------------------------------------------------|
| Purple | Ethereal  | Allows the user to either create portals a short distance away or either retrieve or deposed an item into the Either. |
| Black  | Life/Dark | Gives the user the ability to both drain and restore life from a willing/broken living object.                        |
| Yellow | Kinetic   | Turns the users caloric energy into kinetic energy witch can be, directed towards any thing in sight (max:100m).      |
| White  | Fusing    | Grants the user the ability to combine and control the energy of willing/unconscious channeled energy users.          |
| Pink   | Mind      | Can see and manipulate for a (ep) cost the Mind-web.                                                                  |
| Green  | Time      | Gives the user the ability to glide theme selves and any items on there person thru time for a cost of (ep).          |

*** Ethereal (Purple)
Ethereal energy allows the user to either create portals (max 2m diameter) a short distance away or either retrieve or deposed an item (witch can fit into the hand) into the Either.

**** Level Table
Each Level there are the options two different please only pick one.
| Level        | Opt 1      | Opt 2                                                |
|--------------+------------+------------------------------------------------------|
| Natural      | +1m^3 Hold | +5m Portal Range                                     |
| Novice       | +1m^3 Hold | +10m Portal Range                                    |
| Intermediate | +1m^3 Hold | +10m Portal Range                                    |
| Master       | +2m^3 Hold | +15m Portal Range                                    |
| High Master  | +3m^3 Hold | +500m Portal Range                                   |
| Grand Master | +5m^3 Hold | +1k Portal Range and Pick one former unpicked option |

*** Life/Dark (Black)
 Life energy gives the user the ability to both drain and restore life from a willing/broken entity with life force. The draining of life force restores (ep) while the restoring to others and performing energy actions depletes (ep). For dark energy users the total depletion of (ep) is lethal having low (ep) has negative side effects on the wielder (chart below).

**** Level Table
The ability you choose must be at most of the same level as your creator.
| Level        |                                                            |
|--------------+------------------------------------------------------------|
| Natural      | +1,000 Dark energy Holding +1 Dark ability                 |
| Novice       | +1,000 Dark energy Holding +1 Dark ability                 |
| Intermediate | +3,000 Dark energy Holding +1 Dark ability                 |
| Master       | +5,000 Dark energy Holding +1 Dark ability                 |
| High Master  | +10,000 Dark energy Holding +1 Dark ability                |
| Grand Master | +50,000 Dark energy Holding +1 Dark ability and Dark sight |
