Energy/worldbuilding.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-08-12 Wed 12:37 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Energy World Building</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" type="text/css" href="https://gongzhitaao.org/orgcss/org.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Energy World Building</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org3978ac4">1. Energy</a>
<ul>
<li><a href="#org3b039d9">1.1. Basic Energy Rules</a>
<ul>
<li><a href="#org9f94911">1.1.1. Energy points (ep)</a></li>
<li><a href="#org70051c2">1.1.2. Energy Devices and Crystals</a></li>
</ul>
</li>
<li><a href="#org7c0ccb3">1.2. Energy Types</a>
<ul>
<li><a href="#orga1cc173">1.2.1. Ethereal (Purple)</a></li>
<li><a href="#orgc9c3dca">1.2.2. Life/Dark (Black)</a></li>
<li><a href="#orga97f253">1.2.3. Kinetic (Yellow)</a></li>
<li><a href="#org6dd4a85">1.2.4. Fusing (White)</a></li>
<li><a href="#orgc49a2b2">1.2.5. Mind (Pink)</a></li>
<li><a href="#org830329e">1.2.6. Time (Green)</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org2fa3d78">2. History</a>
<ul>
<li><a href="#orge980475">2.1. Events/Objects</a>
<ul>
<li><a href="#org63070da">2.1.1. Era One</a></li>
</ul>
</li>
<li><a href="#org3309462">2.2. Era One</a>
<ul>
<li><a href="#org6dc480e">2.2.1. 2030</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org868037e">3. Factions</a>
<ul>
<li><a href="#org53b0bb1">3.1. Earth</a>
<ul>
<li><a href="#org58ee202">3.1.1. Major</a></li>
<li><a href="#org91e109d">3.1.2. Minor</a></li>
</ul>
</li>
<li><a href="#orgb2e7b22">3.2. Mars</a></li>
<li><a href="#org325feaf">3.3. Belt</a></li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-org3978ac4" class="outline-2">
<h2 id="org3978ac4"><span class="section-number-2">1</span> Energy</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org3b039d9" class="outline-3">
<h3 id="org3b039d9"><span class="section-number-3">1.1</span> Basic Energy Rules</h3>
<div class="outline-text-3" id="text-1-1">
<p>
All energy requires the user to channel it to be, used. Most energies require both arms to be free for the elbow down.
</p>
</div>
<div id="outline-container-org9f94911" class="outline-4">
<h4 id="org9f94911"><span class="section-number-4">1.1.1</span> Energy points (ep)</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
Some energies require (ep) to use (there are: Life, Kinetic, Time). Energy points is; stored, named, measured and, regained differently for each energy. The energies that don't use (ep) simply manipulate the already excising energy in the world.   
</p>
</div>
</div>
<div id="outline-container-org70051c2" class="outline-4">
<h4 id="org70051c2"><span class="section-number-4">1.1.2</span> Energy Devices and Crystals</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
Energy is a form of power and it obeys the <a href="https://en.wikipedia.org/wiki/First_law_of_thermodynamics">first law of thermodynamics</a> energy crystals are natural deposits of energy most of witch act as batteries as such they can be discharged and then recharged (only can be recharged by a user of the same energy as the crystal). These crystals can be used to power different devices that then can do thighs similar to use energy but at a much lower efficacy.    
</p>
</div>
</div>
</div>

<div id="outline-container-org7c0ccb3" class="outline-3">
<h3 id="org7c0ccb3"><span class="section-number-3">1.2</span> Energy Types</h3>
<div class="outline-text-3" id="text-1-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Color</th>
<th scope="col" class="org-left">Name</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Purple</td>
<td class="org-left">Ethereal</td>
<td class="org-left">Allows the user to either create portals a short distance away or either retrieve or deposed an item into the Either.</td>
</tr>

<tr>
<td class="org-left">Black</td>
<td class="org-left">Life/Dark</td>
<td class="org-left">Gives the user the ability to both drain and restore life from a willing/broken living object.</td>
</tr>

<tr>
<td class="org-left">Yellow</td>
<td class="org-left">Kinetic</td>
<td class="org-left">Turns the users caloric energy into kinetic energy witch can be, directed towards any thing in sight (max:100m).</td>
</tr>

<tr>
<td class="org-left">White</td>
<td class="org-left">Fusing</td>
<td class="org-left">Grants the user the ability to combine and control the energy of willing/unconscious channeled energy users.</td>
</tr>

<tr>
<td class="org-left">Pink</td>
<td class="org-left">Mind</td>
<td class="org-left">Can see and manipulate for a (ep) cost the Mind-web.</td>
</tr>

<tr>
<td class="org-left">Green</td>
<td class="org-left">Time</td>
<td class="org-left">Gives the user the ability to glide theme selves and any items on there person thru time for a cost of (ep).</td>
</tr>
</tbody>
</table>
</div>

<div id="outline-container-orga1cc173" class="outline-4">
<h4 id="orga1cc173"><span class="section-number-4">1.2.1</span> Ethereal (Purple)</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
Ethereal energy allows the user to either create portals (max 2m diameter) a short distance away or either retrieve or deposed an item (witch can fit into the hand) into the Either.
</p>
</div>

<ol class="org-ol">
<li><a id="org3d37958"></a>Level Table<br />
<div class="outline-text-5" id="text-1-2-1-1">
<p>
Each Level there are the options two different please only pick one.
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Level</th>
<th scope="col" class="org-left">Opt 1</th>
<th scope="col" class="org-left">Opt 2</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Natural</td>
<td class="org-left">+1m<sup>3</sup> Hold</td>
<td class="org-left">+5m Portal Range</td>
</tr>

<tr>
<td class="org-left">Novice</td>
<td class="org-left">+1m<sup>3</sup> Hold</td>
<td class="org-left">+10m Portal Range</td>
</tr>

<tr>
<td class="org-left">Intermediate</td>
<td class="org-left">+1m<sup>3</sup> Hold</td>
<td class="org-left">+10m Portal Range</td>
</tr>

<tr>
<td class="org-left">Master</td>
<td class="org-left">+2m<sup>3</sup> Hold</td>
<td class="org-left">+15m Portal Range</td>
</tr>

<tr>
<td class="org-left">High Master</td>
<td class="org-left">+3m<sup>3</sup> Hold</td>
<td class="org-left">+500m Portal Range</td>
</tr>

<tr>
<td class="org-left">Grand Master</td>
<td class="org-left">+5m<sup>3</sup> Hold</td>
<td class="org-left">+1k Portal Range and Pick one former unpicked option</td>
</tr>
</tbody>
</table>
</div>
</li>
</ol>
</div>

<div id="outline-container-orgc9c3dca" class="outline-4">
<h4 id="orgc9c3dca"><span class="section-number-4">1.2.2</span> Life/Dark (Black)</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
Life energy gives the user the ability to both drain and restore life from a willing/broken entity with life force. The draining of life force restores (ep) while the restoring to others and performing energy actions depletes (ep). For dark energy users the total depletion of (ep) is lethal having low (ep) has negative side effects on the wielder (chart below).
</p>
</div>

<ol class="org-ol">
<li><a id="org43d2af6"></a>Level Table<br />
<div class="outline-text-5" id="text-1-2-2-1">
<p>
The ability you choose must be at most of the same level as your creator.
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Level</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Natural</td>
<td class="org-left">+1,000 Dark energy Holding +1 Dark ability</td>
</tr>

<tr>
<td class="org-left">Novice</td>
<td class="org-left">+1,000 Dark energy Holding +1 Dark ability</td>
</tr>

<tr>
<td class="org-left">Intermediate</td>
<td class="org-left">+3,000 Dark energy Holding +1 Dark ability</td>
</tr>

<tr>
<td class="org-left">Master</td>
<td class="org-left">+5,000 Dark energy Holding +1 Dark ability</td>
</tr>

<tr>
<td class="org-left">High Master</td>
<td class="org-left">+10,000 Dark energy Holding +1 Dark ability</td>
</tr>

<tr>
<td class="org-left">Grand Master</td>
<td class="org-left">+50,000 Dark energy Holding +1 Dark ability and Dark sight</td>
</tr>
</tbody>
</table>
</div>
</li>
