Energy/worldbuilding.org
**** Dark Ability Table
To use a ability you must be at lest the same level as the ability. 
| Level        | Name                | Description                                                                                                                         |
|--------------+---------------------+-------------------------------------------------------------------------------------------------------------------------------------|
| Natural      | Dark Energy Control | The user can control up to you max capacity of Dark energy capacity while its in a physical form. (50^3cm = 1,000 Dark(ep))         |
| Novice       | Force Drain         | This allows the user to forcefully drain a targets Life energy (within sight) but at the expense of (2x) the life energy drained.   |
| Novice       | Dark Speak          | Allows the user to speed Dark crystals.                                                                                             |
| Intermediate | Will Brake          | Whom ever uses this is able to brake the will of a creature. This allows draining. (Costs creatures (Str+End+Int-Age)x10 + 3 hours) |
| Intermediate | Energy whips        | Allows you to control as much energy as you like assuming it is in contact with your arms. (Damage ((ep) in whips x .01)D )         |
| Master       | Energy Tentacles    | Control four tentacles on any size as long as there connected to you. at HM the number increase to five an GM eight.                |
| Grand Master | Dark sight          | Allows you the see the total Dark and not Dark (ep) where ever you look                                                             |
**** Energy Point Loss table
| Energy Points | Effect           |
|---------------+------------------|
| 500+ (ep)     | N/A              |
| 499-300 (ep)  | -1 End DM        |
| 299-100 (ep)  | -1 To all roles  |
| 99-50 (ep)    | -5 To all roles  |
| 49 - 1 (ep)   | -10 To all roles |
| 0 (ep)        | Death            |

*** Kinetic (Yellow)
 Turns the users caloric energy into kinetic energy witch can be, directed towards any thing in sight (max:100m). The amount of (ep) the user has stored is, deterred by the users stored caloric energy witch is a 1:1 ration to (ep) but, only one third of the caloric intake can be, used for energy the other 2/3 are, used for normal body functions.

**** Level Table
| Level        |                                                  |
|--------------+--------------------------------------------------|
| Natural      | +100N Max Force                                  |
| Novice       | +100N Max Force                                  |
| Intermediate | +300N Max Force                                  |
| Master       | +500N Max Force                                  |
| High Master  | +10,00N Max Force                                |
| Grand Master | +30,00N Max Force can and control unseen objects |

*** Fusing (White)
Grants the user the ability to combine and control the energy of willing/unconscious channeled energy users. Allowing the to do fused abilities up to the users level.

**** Level Table
| Level        |                                                                                   |
|--------------+-----------------------------------------------------------------------------------|
| Natural      | +2 Source fuse max                                                                |
| Novice       | +3 Source fuse max                                                                |
| Intermediate | +5 Source fuse max                                                                |
| Master       | +10 Source fuse max                                                               |
| High Master  | +30 Source fuse max                                                               |
| Grand Master | +50 Source fuse max and can channel and learn to control the energy for a crystal of all types |

**** Fused Energy Abilities Table
| Level        | Energies        | Name       | Description                                                                                                                                     |
|--------------+-----------------+------------+-------------------------------------------------------------------------------------------------------------------------------------------------|
| Intermediate | Ethereal & Life | Black hole | Forms a black hole (max 2m Diameter) that sucks the life energy out of anyone in a 1k radius.                                                   |
| Intermediate | Kinetic & Life  | Life Steal | For the cost of 3x Dark (ep) and 10 Kinetic (ep)/min file Force drain is instant and has a pushily effect on any one within a 1m of the victim. |
|              |                 |            |                                                                                                                                                 |

*** Mind (Pink)
Can see and manipulate for a (ep) cost the Mind-web. the Mind-web is both the web of ideas in ones mind as well as the web of ideas amongst individuals and groups. Energy points must be used to do any manipulations to find the (ep) cost multiply the group size by the manipulation size to get the total (ep) cost. Mind energy is gained by daring minds of one the user has killed this will permanently leave the user with this persons memories witch will lead to insanity of time as well as loss of ones selfie.    

**** Level Table
| Level        |                                                                                      |
|--------------+--------------------------------------------------------------------------------------|
| Natural      | Can only see the web on a individual level and can't manipulate it.                  |
| Novice       | Can only see the web on a individual level and can only do small manipulations it.   |
| Intermediate | Can only see the web on a Small Group level and can only do small manipulations it.  |
| Master       | Can only see the web on a Small Group level and can only do medium manipulations it. |
| High Master  | Can only see the web on a Large Group level and can only do medium manipulations it. |
| Grand Master | Can see the web on a total level and can do Large manipulations it.                  |
