Energy/worldbuilding.html
<li><a id="org0691433"></a>Dark Ability Table<br />
<div class="outline-text-5" id="text-1-2-2-2">
<p>
To use a ability you must be at lest the same level as the ability. 
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Level</th>
<th scope="col" class="org-left">Name</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Natural</td>
<td class="org-left">Dark Energy Control</td>
<td class="org-left">The user can control up to you max capacity of Dark energy capacity while its in a physical form. (50<sup>3cm</sup> = 1,000 Dark(ep))</td>
</tr>

<tr>
<td class="org-left">Novice</td>
<td class="org-left">Force Drain</td>
<td class="org-left">This allows the user to forcefully drain a targets Life energy (within sight) but at the expense of (2x) the life energy drained.</td>
</tr>

<tr>
<td class="org-left">Novice</td>
<td class="org-left">Dark Speak</td>
<td class="org-left">Allows the user to speed Dark crystals.</td>
</tr>

<tr>
<td class="org-left">Intermediate</td>
<td class="org-left">Will Brake</td>
<td class="org-left">Whom ever uses this is able to brake the will of a creature. This allows draining. (Costs creatures (Str+End+Int-Age)x10 + 3 hours)</td>
</tr>

<tr>
<td class="org-left">Intermediate</td>
<td class="org-left">Energy whips</td>
<td class="org-left">Allows you to control as much energy as you like assuming it is in contact with your arms. (Damage ((ep) in whips x .01)D )</td>
</tr>

<tr>
<td class="org-left">Master</td>
<td class="org-left">Energy Tentacles</td>
<td class="org-left">Control four tentacles on any size as long as there connected to you. at HM the number increase to five an GM eight.</td>
</tr>

<tr>
<td class="org-left">Grand Master</td>
<td class="org-left">Dark sight</td>
<td class="org-left">Allows you the see the total Dark and not Dark (ep) where ever you look</td>
</tr>
</tbody>
</table>
</div>
</li>
<li><a id="org356a4e6"></a>Energy Point Loss table<br />
<div class="outline-text-5" id="text-1-2-2-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Energy Points</th>
<th scope="col" class="org-left">Effect</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">500+ (ep)</td>
<td class="org-left">N/A</td>
</tr>

<tr>
<td class="org-left">499-300 (ep)</td>
<td class="org-left">-1 End DM</td>
</tr>

<tr>
<td class="org-left">299-100 (ep)</td>
<td class="org-left">-1 To all roles</td>
</tr>

<tr>
<td class="org-left">99-50 (ep)</td>
<td class="org-left">-5 To all roles</td>
</tr>

<tr>
<td class="org-left">49 - 1 (ep)</td>
<td class="org-left">-10 To all roles</td>
</tr>

<tr>
<td class="org-left">0 (ep)</td>
<td class="org-left">Death</td>
</tr>
</tbody>
</table>
</div>
</li>
</ol>
</div>

<div id="outline-container-orga97f253" class="outline-4">
<h4 id="orga97f253"><span class="section-number-4">1.2.3</span> Kinetic (Yellow)</h4>
<div class="outline-text-4" id="text-1-2-3">
<p>
Turns the users caloric energy into kinetic energy witch can be, directed towards any thing in sight (max:100m). The amount of (ep) the user has stored is, deterred by the users stored caloric energy witch is a 1:1 ration to (ep) but, only one third of the caloric intake can be, used for energy the other 2/3 are, used for normal body functions.
</p>
</div>

<ol class="org-ol">
<li><a id="org1dc9be0"></a>Level Table<br />
<div class="outline-text-5" id="text-1-2-3-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Level</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Natural</td>
<td class="org-left">+100N Max Force</td>
</tr>

<tr>
<td class="org-left">Novice</td>
<td class="org-left">+100N Max Force</td>
</tr>

<tr>
<td class="org-left">Intermediate</td>
<td class="org-left">+300N Max Force</td>
</tr>

<tr>
<td class="org-left">Master</td>
<td class="org-left">+500N Max Force</td>
</tr>

<tr>
<td class="org-left">High Master</td>
<td class="org-left">+10,00N Max Force</td>
</tr>

<tr>
<td class="org-left">Grand Master</td>
<td class="org-left">+30,00N Max Force can and control unseen objects</td>
</tr>
</tbody>
</table>
</div>
</li>
</ol>
</div>

<div id="outline-container-org6dd4a85" class="outline-4">
<h4 id="org6dd4a85"><span class="section-number-4">1.2.4</span> Fusing (White)</h4>
<div class="outline-text-4" id="text-1-2-4">
<p>
Grants the user the ability to combine and control the energy of willing/unconscious channeled energy users. Allowing the to do fused abilities up to the users level.
</p>
</div>

<ol class="org-ol">
<li><a id="org7838bde"></a>Level Table<br />
<div class="outline-text-5" id="text-1-2-4-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Level</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Natural</td>
<td class="org-left">+2 Source fuse max</td>
</tr>

<tr>
<td class="org-left">Novice</td>
<td class="org-left">+3 Source fuse max</td>
</tr>

<tr>
<td class="org-left">Intermediate</td>
<td class="org-left">+5 Source fuse max</td>
</tr>

<tr>
<td class="org-left">Master</td>
<td class="org-left">+10 Source fuse max</td>
</tr>

<tr>
<td class="org-left">High Master</td>
<td class="org-left">+30 Source fuse max</td>
</tr>

<tr>
<td class="org-left">Grand Master</td>
<td class="org-left">+50 Source fuse max and can channel and learn to control the energy for a crystal of all types</td>
</tr>
</tbody>
</table>
</div>
</li>

<li><a id="orge07b817"></a>Fused Energy Abilities Table<br />
<div class="outline-text-5" id="text-1-2-4-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Level</th>
<th scope="col" class="org-left">Energies</th>
<th scope="col" class="org-left">Name</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Intermediate</td>
<td class="org-left">Ethereal &amp; Life</td>
<td class="org-left">Black hole</td>
<td class="org-left">Forms a black hole (max 2m Diameter) that sucks the life energy out of anyone in a 1k radius.</td>
</tr>

<tr>
<td class="org-left">Intermediate</td>
<td class="org-left">Kinetic &amp; Life</td>
<td class="org-left">Life Steal</td>
<td class="org-left">For the cost of 3x Dark (ep) and 10 Kinetic (ep)/min file Force drain is instant and has a pushily effect on any one within a 1m of the victim.</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</li>
</ol>
</div>

<div id="outline-container-orgc49a2b2" class="outline-4">
<h4 id="orgc49a2b2"><span class="section-number-4">1.2.5</span> Mind (Pink)</h4>
<div class="outline-text-4" id="text-1-2-5">
<p>
Can see and manipulate for a (ep) cost the Mind-web. the Mind-web is both the web of ideas in ones mind as well as the web of ideas amongst individuals and groups. Energy points must be used to do any manipulations to find the (ep) cost multiply the group size by the manipulation size to get the total (ep) cost. Mind energy is gained by daring minds of one the user has killed this will permanently leave the user with this persons memories witch will lead to insanity of time as well as loss of ones selfie.    
</p>
</div>

<ol class="org-ol">
<li><a id="orgcf97533"></a>Level Table<br />
<div class="outline-text-5" id="text-1-2-5-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Level</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Natural</td>
<td class="org-left">Can only see the web on a individual level and can't manipulate it.</td>
</tr>

<tr>
<td class="org-left">Novice</td>
<td class="org-left">Can only see the web on a individual level and can only do small manipulations it.</td>
</tr>

<tr>
<td class="org-left">Intermediate</td>
<td class="org-left">Can only see the web on a Small Group level and can only do small manipulations it.</td>
</tr>

<tr>
<td class="org-left">Master</td>
<td class="org-left">Can only see the web on a Small Group level and can only do medium manipulations it.</td>
</tr>

<tr>
<td class="org-left">High Master</td>
<td class="org-left">Can only see the web on a Large Group level and can only do medium manipulations it.</td>
</tr>

<tr>
<td class="org-left">Grand Master</td>
<td class="org-left">Can see the web on a total level and can do Large manipulations it.</td>
</tr>
</tbody>
</table>
</div>
<ol class="org-ol">
