Energy/worldbuilding.org
***** Groups Sizes
| Size       | Number of people | (ep) cost |
|------------+------------------+-----------|
| Individual |                1 |         1 |
| Small      |               10 |         5 |
| Large      |              100 |        10 |
| Total      |              All |        15 |
***** Manipulation sizes
| Size   |                               | (ep) cost |
|--------+-------------------------------+-----------|
| Small  | A detail                      |         1 |
| Medium | Multiple details up to five   |         5 |
| Large  | Total fabrication of a memory |        10 |

*** Time (Green)
Gives the user the ability to glide theme selves and any items on there person thru time for a cost of (ep), But either traveling too fast or to far can have severe side effects in the forum of uncontrollable displacement thru time. Whilst traveling thru time the user will NOT be move in position relative the nearest gravitational body of ant lest 3/10G . 

**** Level Table
For jumps larger than the max safe time refer the function blow.
| Level        |                       |
|--------------+-----------------------|
| Natural      | Max safe travel 5m.   |
| Novice       | Max safe travel 15m.  |
| Intermediate | Max safe travel 25m.  |
| Master       | Max safe travel 30m.  |
| High Master  | Max safe travel 60m.  |
| Grand Master | Max safe travel 100m. |
***** Jump distance function
This is used to both find and, represent how to find the random variation in time energy time travel.    

#+BEGIN_SRC python :results output
  import random

  timeJumped = 5 #Change to the Time being jumped.
  level = 0 #Change to current level Nat:0, Nov:1, Int:2, Ma:3, Hm:4 and, Gm:5.
  doLastJumpCalc = False # Do you whant to do the last jump calc? true = yes false = no
  timeSinceLastJump = 0 # How long has it been since the last jump?
  lastJumpDistance = 0 # How long was your last jump?

  def levelMax(level):
	    if level == 0 : return 5
	    elif level == 1 : return 15
	    elif level == 2 : return 25
	    elif level == 3 : return 30
	    elif level == 4 : return 60
	    elif level == 5 : return 100
	    else: return 5

  def timeJumpedOver(timeJumped,level):
	    timeJumpedOver = timeJumped - levelMax(level)
	    if timeJumped < 0: return 0
	    else: return timeJumpedOver

  def timeJumpedOverPercentage(timeJumped,level,doLastJumpCalc,timeSinceLastJump,lastJumpDistance):
	    if(doLastJumpCalc == True and lastJumpDistance > timeSinceLastJump and timeSinceLastJump != 0):
		      return timeJumped/(levelMax(level) - (lastJumpDistance - timeSinceLastJump))
	    elif timeSinceLastJump == 0: return 1
	    else: return timeJumped/levelMax(level)

  def jumpedBackDistance(level,timeJumped,timeJumpedOver,doLastJumpCalc,timeSinceLastJump,lastJumpDistance):
	    if levelMax(level) == timeJumped and doLastJumpCalc == False: return timeJumped
	    elif timeJumpedOverPercentage(timeJumped,level,doLastJumpCalc,timeSinceLastJump,lastJumpDistance) <= 1: return timeJumped + random.uniform(levelMax(level)*1, levelMax(level)*2) 
	    elif timeJumpedOverPercentage(timeJumped,level,doLastJumpCalc,timeSinceLastJump,lastJumpDistance) <= 2: return timeJumped + random.uniform(levelMax(level)*2, levelMax(level)*4) 
	    elif timeJumpedOverPercentage(timeJumped,level,doLastJumpCalc,timeSinceLastJump,lastJumpDistance) <= 3: return timeJumped + random.uniform(levelMax(level)*3, levelMax(level)*5) 
	    elif timeJumpedOverPercentage(timeJumped,level,doLastJumpCalc,timeSinceLastJump,lastJumpDistance) <= 5: return timeJumped + random.uniform(levelMax(level)*4, levelMax(level)*6)
	    else: return -1


  def printOutput(level,timeJumped,timeJumpedOverPercentage,doLastJumpCalc,timeSinceLastJump,lastJumpDistance):
	    print("Jumped", jumpedBackDistance(level,timeJumped,timeJumpedOver,doLastJumpCalc,timeSinceLastJump,lastJumpDistance), "minutes back in time.")
  printOutput(level,timeJumped,timeJumpedOverPercentage,doLastJumpCalc,timeSinceLastJump,lastJumpDistance)
#+END_SRC

#+RESULTS:
: Jumped 5 minutes back in time.

* History
All of this is till a heavy work in progress. 
** Events/Objects
*** Era One
**** The Western Shield Project
The WSP is a complex grid of lazier and missal defense grids designed to protect western airspace and airspace of western interest form threats of both terrestrial and explanatory origin.

** Era One
*** 2030
Commercial space travel is a economically viable as well as the [[The Western Shield Project][Western Shield Project]] is in the works between the US and UK.

* Factions
** Earth
*** Major
**** Western Collision
