Energy/worldbuilding.html
<li><a id="orgef2b7fb"></a>Groups Sizes<br />
<div class="outline-text-6" id="text-1-2-5-1-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Size</th>
<th scope="col" class="org-right">Number of people</th>
<th scope="col" class="org-right">(ep) cost</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Individual</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-left">Small</td>
<td class="org-right">10</td>
<td class="org-right">5</td>
</tr>

<tr>
<td class="org-left">Large</td>
<td class="org-right">100</td>
<td class="org-right">10</td>
</tr>

<tr>
<td class="org-left">Total</td>
<td class="org-right">All</td>
<td class="org-right">15</td>
</tr>
</tbody>
</table>
</div>
</li>
<li><a id="org7e69c43"></a>Manipulation sizes<br />
<div class="outline-text-6" id="text-1-2-5-1-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Size</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-right">(ep) cost</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Small</td>
<td class="org-left">A detail</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-left">Medium</td>
<td class="org-left">Multiple details up to five</td>
<td class="org-right">5</td>
</tr>

<tr>
<td class="org-left">Large</td>
<td class="org-left">Total fabrication of a memory</td>
<td class="org-right">10</td>
</tr>
</tbody>
</table>
</div>
</li>
</ol>
</li>
</ol>
</div>

<div id="outline-container-org830329e" class="outline-4">
<h4 id="org830329e"><span class="section-number-4">1.2.6</span> Time (Green)</h4>
<div class="outline-text-4" id="text-1-2-6">
<p>
Gives the user the ability to glide theme selves and any items on there person thru time for a cost of (ep), But either traveling too fast or to far can have severe side effects in the forum of uncontrollable displacement thru time. Whilst traveling thru time the user will NOT be move in position relative the nearest gravitational body of ant lest 3/10G . 
</p>
</div>

<ol class="org-ol">
<li><a id="org63d7fa4"></a>Level Table<br />
<div class="outline-text-5" id="text-1-2-6-1">
<p>
For jumps larger than the max safe time refer the function blow.
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Level</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Natural</td>
<td class="org-left">Max safe travel 5m.</td>
</tr>

<tr>
<td class="org-left">Novice</td>
<td class="org-left">Max safe travel 15m.</td>
</tr>

<tr>
<td class="org-left">Intermediate</td>
<td class="org-left">Max safe travel 25m.</td>
</tr>

<tr>
<td class="org-left">Master</td>
<td class="org-left">Max safe travel 30m.</td>
</tr>

<tr>
<td class="org-left">High Master</td>
<td class="org-left">Max safe travel 60m.</td>
</tr>

<tr>
<td class="org-left">Grand Master</td>
<td class="org-left">Max safe travel 100m.</td>
</tr>
</tbody>
</table>
</div>
<ol class="org-ol">
<li><a id="org6168bd9"></a>Jump distance function<br />
<div class="outline-text-6" id="text-1-2-6-1-1">
<p>
This is used to both find and, represent how to find the random variation in time energy time travel.    
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #9cdcfe;">import</span> random

<span style="color: #fff;">timeJumped</span> = 5 <span style="color: #5C6370;">#</span><span style="color: #5C6370;">Change to the Time being jumped.</span>
<span style="color: #fff;">level</span> = 0 <span style="color: #5C6370;">#</span><span style="color: #5C6370;">Change to current level Nat:0, Nov:1, Int:2, Ma:3, Hm:4 and, Gm:5.</span>
<span style="color: #fff;">doLastJumpCalc</span> = <span style="color: #569cd6;">False</span> <span style="color: #5C6370;"># </span><span style="color: #5C6370;">Do you whant to do the last jump calc? true = yes false = no</span>
<span style="color: #fff;">timeSinceLastJump</span> = 0 <span style="color: #5C6370;"># </span><span style="color: #5C6370;">How long has it been since the last jump?</span>
<span style="color: #fff;">lastJumpDistance</span> = 0 <span style="color: #5C6370;"># </span><span style="color: #5C6370;">How long was your last jump?</span>

<span style="color: #9cdcfe;">def</span> <span style="color: #dcdcaa;">levelMax</span>(level):
          <span style="color: #9cdcfe;">if</span> level == 0 : <span style="color: #9cdcfe;">return</span> 5
          <span style="color: #9cdcfe;">elif</span> level == 1 : <span style="color: #9cdcfe;">return</span> 15
          <span style="color: #9cdcfe;">elif</span> level == 2 : <span style="color: #9cdcfe;">return</span> 25
          <span style="color: #9cdcfe;">elif</span> level == 3 : <span style="color: #9cdcfe;">return</span> 30
          <span style="color: #9cdcfe;">elif</span> level == 4 : <span style="color: #9cdcfe;">return</span> 60
          <span style="color: #9cdcfe;">elif</span> level == 5 : <span style="color: #9cdcfe;">return</span> 100
          <span style="color: #9cdcfe;">else</span>: <span style="color: #9cdcfe;">return</span> 5

<span style="color: #9cdcfe;">def</span> <span style="color: #dcdcaa;">timeJumpedOver</span>(timeJumped,level):
          <span style="color: #fff;">timeJumpedOver</span> = timeJumped - levelMax(level)
          <span style="color: #9cdcfe;">if</span> timeJumped &lt; 0: <span style="color: #9cdcfe;">return</span> 0
          <span style="color: #9cdcfe;">else</span>: <span style="color: #9cdcfe;">return</span> timeJumpedOver

<span style="color: #9cdcfe;">def</span> <span style="color: #dcdcaa;">timeJumpedOverPercentage</span>(timeJumped,level,doLastJumpCalc,timeSinceLastJump,lastJumpDistance):
          <span style="color: #9cdcfe;">if</span>(doLastJumpCalc == <span style="color: #569cd6;">True</span> <span style="color: #9cdcfe;">and</span> lastJumpDistance &gt; timeSinceLastJump <span style="color: #9cdcfe;">and</span> timeSinceLastJump != 0):
                    <span style="color: #9cdcfe;">return</span> timeJumped/(levelMax(level) - (lastJumpDistance - timeSinceLastJump))
          <span style="color: #9cdcfe;">elif</span> timeSinceLastJump == 0: <span style="color: #9cdcfe;">return</span> 1
          <span style="color: #9cdcfe;">else</span>: <span style="color: #9cdcfe;">return</span> timeJumped/levelMax(level)

<span style="color: #9cdcfe;">def</span> <span style="color: #dcdcaa;">jumpedBackDistance</span>(level,timeJumped,timeJumpedOver,doLastJumpCalc,timeSinceLastJump,lastJumpDistance):
          <span style="color: #9cdcfe;">if</span> levelMax(level) == timeJumped <span style="color: #9cdcfe;">and</span> doLastJumpCalc == <span style="color: #569cd6;">False</span>: <span style="color: #9cdcfe;">return</span> timeJumped
          <span style="color: #9cdcfe;">elif</span> timeJumpedOverPercentage(timeJumped,level,doLastJumpCalc,timeSinceLastJump,lastJumpDistance) &lt;= 1: <span style="color: #9cdcfe;">return</span> timeJumped + random.uniform(levelMax(level)*1, levelMax(level)*2) 
          <span style="color: #9cdcfe;">elif</span> timeJumpedOverPercentage(timeJumped,level,doLastJumpCalc,timeSinceLastJump,lastJumpDistance) &lt;= 2: <span style="color: #9cdcfe;">return</span> timeJumped + random.uniform(levelMax(level)*2, levelMax(level)*4) 
          <span style="color: #9cdcfe;">elif</span> timeJumpedOverPercentage(timeJumped,level,doLastJumpCalc,timeSinceLastJump,lastJumpDistance) &lt;= 3: <span style="color: #9cdcfe;">return</span> timeJumped + random.uniform(levelMax(level)*3, levelMax(level)*5) 
          <span style="color: #9cdcfe;">elif</span> timeJumpedOverPercentage(timeJumped,level,doLastJumpCalc,timeSinceLastJump,lastJumpDistance) &lt;= 5: <span style="color: #9cdcfe;">return</span> timeJumped + random.uniform(levelMax(level)*4, levelMax(level)*6)
          <span style="color: #9cdcfe;">else</span>: <span style="color: #9cdcfe;">return</span> -1


<span style="color: #9cdcfe;">def</span> <span style="color: #dcdcaa;">printOutput</span>(level,timeJumped,timeJumpedOverPercentage,doLastJumpCalc,timeSinceLastJump,lastJumpDistance):
          <span style="color: #9cdcfe;">print</span>(<span style="color: #7cb461;">"Jumped"</span>, jumpedBackDistance(level,timeJumped,timeJumpedOver,doLastJumpCalc,timeSinceLastJump,lastJumpDistance), <span style="color: #7cb461;">"minutes back in time."</span>)
printOutput(level,timeJumped,timeJumpedOverPercentage,doLastJumpCalc,timeSinceLastJump,lastJumpDistance)
</pre>
</div>
</div>
</li>
</ol>
</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org2fa3d78" class="outline-2">
<h2 id="org2fa3d78"><span class="section-number-2">2</span> History</h2>
<div class="outline-text-2" id="text-2">
<p>
All of this is till a heavy work in progress. 
</p>
</div>
<div id="outline-container-orge980475" class="outline-3">
<h3 id="orge980475"><span class="section-number-3">2.1</span> Events/Objects</h3>
<div class="outline-text-3" id="text-2-1">
</div>
<div id="outline-container-org63070da" class="outline-4">
<h4 id="org63070da"><span class="section-number-4">2.1.1</span> Era One</h4>
<div class="outline-text-4" id="text-2-1-1">
</div>
<ol class="org-ol">
<li><a id="orgd815bc0"></a>The Western Shield Project<br />
<div class="outline-text-5" id="text-2-1-1-1">
<p>
The WSP is a complex grid of lazier and missal defense grids designed to protect western airspace and airspace of western interest form threats of both terrestrial and explanatory origin.
</p>
</div>
</li>
</ol>
</div>
</div>

<div id="outline-container-org3309462" class="outline-3">
<h3 id="org3309462"><span class="section-number-3">2.2</span> Era One</h3>
<div class="outline-text-3" id="text-2-2">
</div>
<div id="outline-container-org6dc480e" class="outline-4">
<h4 id="org6dc480e"><span class="section-number-4">2.2.1</span> 2030</h4>
<div class="outline-text-4" id="text-2-2-1">
<p>
Commercial space travel is a economically viable as well as the <a href="#orgd815bc0">Western Shield Project</a> is in the works between the US and UK.
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org868037e" class="outline-2">
<h2 id="org868037e"><span class="section-number-2">3</span> Factions</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org53b0bb1" class="outline-3">
<h3 id="org53b0bb1"><span class="section-number-3">3.1</span> Earth</h3>
<div class="outline-text-3" id="text-3-1">
</div>
<div id="outline-container-org58ee202" class="outline-4">
<h4 id="org58ee202"><span class="section-number-4">3.1.1</span> Major</h4>
<div class="outline-text-4" id="text-3-1-1">
</div>
<ol class="org-ol">
<li><a id="orgb367b1a"></a>Western Collision<br />
<ol class="org-ol">
